#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/terrastates/QuackyNotesInfra/runs/run-NbWe9RrNX695BqBX

Waiting for the plan to start...

Terraform v1.4.4
on linux_amd64
Initializing plugins and modules...
random_id.server_PR_1: Refreshing state... [id=SJlwrX4rcJY]
aws_key_pair.staging_key: Refreshing state... [id=staging-key]
aws_security_group.staging_rules: Refreshing state... [id=sg-092ce0e64bbe7a5c4]
aws_instance.staging_cicd_demo_PR_1: Refreshing state... [id=i-04e101cd58f062a19]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_instance.staging_cicd_demo_PR_1 has been deleted
  - resource "aws_instance" "staging_cicd_demo_PR_1" {
        id                                   = "i-04e101cd58f062a19"
      - public_dns                           = "ec2-54-91-22-204.compute-1.amazonaws.com" -> null
        tags                                 = {
            "Name" = "staging_cicd_demo-PR_1"
        }
        # (29 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.staging_cicd_demo_PR_1 will be created
  + resource "aws_instance" "staging_cicd_demo_PR_1" {
      + ami                                  = "ami-007855ac798b5175e"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "staging-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "staging_cicd_demo-PR_1"
        }
      + tags_all                             = {
          + "Name" = "staging_cicd_demo-PR_1"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "c4a49a72b18dfcc57129c36641e4f8fa271e493d"
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-092ce0e64bbe7a5c4",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ staging_dns_PR_1 = "ec2-54-91-22-204.compute-1.amazonaws.com" -> (known after apply)

```

</details>

*Pusher: @AndresDavidArcos, Action: `workflow_dispatch`*